afc_saaspro_tax/afc_soap_apis/SOAP/Templates/CalcTaxesWithPCode-Template.xml

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:tem="http://tempuri.org/" xmlns:ezt="http://schemas.datacontract.org/2004/07/EZTaxWebService">
   <soap:Header/>
   <soap:Body>
      <tem:CalcTaxesWithPCode>
         <tem:aTransaction>
            <ezt:AdjustmentMethod>?</ezt:AdjustmentMethod>
            <ezt:BillToAddress>
               <ezt:CountryISO>?</ezt:CountryISO>
               <ezt:County>?</ezt:County>
               <ezt:Locality>?</ezt:Locality>
               <ezt:State>?</ezt:State>
               <ezt:ZipCode>?</ezt:ZipCode>
               <ezt:ZipP4>?</ezt:ZipP4>
            </ezt:BillToAddress>
            <ezt:BillToFipsCode>?</ezt:BillToFipsCode>
            <ezt:BillToNpaNxx>?</ezt:BillToNpaNxx>
            <ezt:BillToPCode>?</ezt:BillToPCode>
            <ezt:BusinessClass>?</ezt:BusinessClass>
            <ezt:CategoryExemptions>
               <ezt:CategoryExemption>
                  <ezt:CountryISO>?</ezt:CountryISO>
                  <ezt:State>?</ezt:State>
                  <ezt:TaxCategory>?</ezt:TaxCategory>
               </ezt:CategoryExemption>
            </ezt:CategoryExemptions>
            <ezt:Charge>?</ezt:Charge>
            <ezt:Commit>?</ezt:Commit>
            <ezt:CompanyIdentifier>?</ezt:CompanyIdentifier>
            <ezt:CountyExempt>?</ezt:CountyExempt>
            <ezt:CountyPCode>?</ezt:CountyPCode>
            <ezt:CustomerNumber>?</ezt:CustomerNumber>
            <ezt:CustomerType>?</ezt:CustomerType>
            <ezt:Date>?</ezt:Date>
            <ezt:Debit>?</ezt:Debit>
            <ezt:DiscountType>?</ezt:DiscountType>
            <ezt:DocumentCode>?</ezt:DocumentCode>
            <ezt:Exclusions>
               <ezt:Exclusion>
                  <ezt:CountryISO>?</ezt:CountryISO>
                  <ezt:ExclusionOn>?</ezt:ExclusionOn>
                  <ezt:State>?</ezt:State>
               </ezt:Exclusion>
            </ezt:Exclusions>
            <ezt:ExemptionType>?</ezt:ExemptionType>
            <ezt:Exemptions>
               <ezt:TaxExemption>
                  <ezt:PCode>?</ezt:PCode>
                  <ezt:TaxLevel>?</ezt:TaxLevel>
                  <ezt:TaxType>?</ezt:TaxType>
               </ezt:TaxExemption>
            </ezt:Exemptions>
            <ezt:FacilitiesBased>?</ezt:FacilitiesBased>
            <ezt:FederalExempt>?</ezt:FederalExempt>
            <ezt:FederalPCode>?</ezt:FederalPCode>
            <ezt:Franchise>?</ezt:Franchise>
            <ezt:Incorporated>?</ezt:Incorporated>
            <ezt:InvoiceNumber>?</ezt:InvoiceNumber>
            <ezt:IsPrivateLine>?</ezt:IsPrivateLine>
            <ezt:Lifeline>?</ezt:Lifeline>
            <ezt:Lines>?</ezt:Lines>
            <ezt:LocalExempt>?</ezt:LocalExempt>
            <ezt:LocalPCode>?</ezt:LocalPCode>
            <ezt:Locations>?</ezt:Locations>
            <ezt:Minutes>?</ezt:Minutes>
            <ezt:Optional>?</ezt:Optional>
            <ezt:Optional10>?</ezt:Optional10>
            <ezt:Optional4>?</ezt:Optional4>
            <ezt:Optional5>?</ezt:Optional5>
            <ezt:Optional6>?</ezt:Optional6>
            <ezt:Optional7>?</ezt:Optional7>
            <ezt:Optional8>?</ezt:Optional8>
            <ezt:Optional9>?</ezt:Optional9>
            <ezt:OptionalAlpha1>?</ezt:OptionalAlpha1>
            <ezt:OptionalFields>
               <ezt:OptionalField>
                  <ezt:OptionalKeyNo>?</ezt:OptionalKeyNo>
                  <ezt:OptionalValue>?</ezt:OptionalValue>
               </ezt:OptionalField>
            </ezt:OptionalFields>
            <ezt:OriginationAddress>
               <ezt:CountryISO>?</ezt:CountryISO>
               <ezt:County>?</ezt:County>
               <ezt:Locality>?</ezt:Locality>
               <ezt:State>?</ezt:State>
               <ezt:ZipCode>?</ezt:ZipCode>
               <ezt:ZipP4>?</ezt:ZipP4>
            </ezt:OriginationAddress>
            <ezt:OriginationFipsCode>?</ezt:OriginationFipsCode>
            <ezt:OriginationNpaNxx>?</ezt:OriginationNpaNxx>
            <ezt:OriginationPCode>?</ezt:OriginationPCode>
            <ezt:PrivateLineSplit>?</ezt:PrivateLineSplit>
            <ezt:Regulated>?</ezt:Regulated>
            <ezt:SafeHarborOverrides>
               <ezt:SafeHarborOverride>
                  <ezt:NewFederalTam>?</ezt:NewFederalTam>
                  <ezt:OriginalFederalTam>?</ezt:OriginalFederalTam>
                  <ezt:SafeHarborType>?</ezt:SafeHarborType>
               </ezt:SafeHarborOverride>
            </ezt:SafeHarborOverrides>
            <ezt:Sale>?</ezt:Sale>
            <ezt:ServiceClass>?</ezt:ServiceClass>
            <ezt:ServiceLevelNumber>?</ezt:ServiceLevelNumber>
            <ezt:ServiceType>?</ezt:ServiceType>
            <ezt:StateExempt>?</ezt:StateExempt>
            <ezt:StatePCode>?</ezt:StatePCode>
            <ezt:TaxInclusive>?</ezt:TaxInclusive>
            <ezt:TerminationAddress>
               <ezt:CountryISO>?</ezt:CountryISO>
               <ezt:County>?</ezt:County>
               <ezt:Locality>?</ezt:Locality>
               <ezt:State>?</ezt:State>
               <ezt:ZipCode>?</ezt:ZipCode>
               <ezt:ZipP4>?</ezt:ZipP4>
            </ezt:TerminationAddress>
            <ezt:TerminationFipsCode>?</ezt:TerminationFipsCode>
            <ezt:TerminationNpaNxx>?</ezt:TerminationNpaNxx>
            <ezt:TerminationPCode>?</ezt:TerminationPCode>
            <ezt:TransactionType>?</ezt:TransactionType>
         </tem:aTransaction>
      </tem:CalcTaxesWithPCode>
   </soap:Body>
</soap:Envelope>